ServiceDesk/src/DataProcessors/ЗаполнитьПроизводственныйКалендарь/ЗаполнитьПроизводственныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнитьПроизводственныйКалендарь</name>
</mdclass:DataProcessor>

ServiceDesk/src/InformationRegisters/ПроизводственныйКалендарь/ПроизводственныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроизводственныйКалендарь</name>
  <resources>
    <name>Пятидневка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Шестидневка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КалендарныеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ВидыДнейПроизводственногоКалендаря</types>
    </type>
  </resources>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаКалендаря</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ServiceDesk/src/Enums/ВидыДнейПроизводственногоКалендаря/ВидыДнейПроизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДнейПроизводственногоКалендаря</name>
  <enumValues>
    <name>Рабочий</name>
  </enumValues>
  <enumValues>
    <name>Суббота</name>
  </enumValues>
  <enumValues>
    <name>Воскресенье</name>
  </enumValues>
  <enumValues>
    <name>Предпраздничный</name>
  </enumValues>
  <enumValues>
    <name>Праздник</name>
  </enumValues>
</mdclass:Enum>

ServiceDesk/src/DataProcessors/ЗаполнитьПроизводственныйКалендарь/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере(Год);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьНаСервере(Год)
	
	ДатаНачалаГода	= НачалоГода(Дата(Год,1,1));
	ДатаКонцаГода	= КонецГода(ДатаНачалаГода);
	
	ДатаДня	= ДатаНачалаГода;
	
	Пока ДатаДня <= ДатаКонцаГода Цикл
		
		Запись	= РегистрыСведений.ПроизводственныйКалендарь.СоздатьМенеджерЗаписи();
		
		Запись.ДатаКалендаря	= ДатаДня;
		Запись.Год				= Год;
		
		ДеньНедели	= ДеньНедели(ДатаДня);
	
		Запись.Пятидневка		= ?(ДеньНедели <= 5, 1, 0);
		Запись.Шестидневка		= ?(ДеньНедели <= 6, 1, 0);
		Запись.КалендарныеДни   = 1;
		
		Если ДеньНедели = 6 Тогда
			Запись.ВидДня			= Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота;
		ИначеЕсли ДеньНедели = 7 Тогда
			Запись.ВидДня			= Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье;
		Иначе
			Запись.ВидДня			= Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий;
		КонецЕсли;
		
		Запись.Записать();
		
		ДатаДня	= ДатаДня + 86400;
		
	КонецЦикла;	
	
КонецПроцедуры
